In [34]:
import pandas as pd
import numpy as np
df = pd.read_csv('Titanic.csv')

### Q_1: Split the Titanic DataFrame df into two parts: df1 (first 500 rows) and df2 (remaining rows). Concatenate them vertically to recreate the original DataFrame.

In [28]:
df1 = df.iloc[:500]
df2 = df.iloc[500:] 

df_recreated = pd.concat([df1, df2], axis=0)
print(df.equals(df_recreated))
df_recreated.head()

True

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### Q_2: Create a new DataFrame passenger_details with columns PassengerId and Nationality. Perform a left join to merge it with df, keeping all original passengers.

In [38]:
passenger_details = pd.DataFrame({
    'PassengerId': [1, 2, 3, 4, 5],
    'Nationality': ['British', 'American', 'French', 'German', 'Italian']
})

df_merged = pd.merge(df, passenger_details, on='PassengerId', how='left')
df_merged.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Nationality
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,NaN
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,NaN
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,NaN

### Q_3 :  Group the data by Pclass and Sex, then calculate the average Age and total Fare for each group.

In [40]:
grouped_result = df.groupby(['Pclass', 'Sex']).agg({
    'Age': 'mean',
    'Fare': 'sum'
}).reset_index()

print(grouped_result)

   Pclass     Sex        Age       Fare
0       1  female  41.333333  5779.5584
1       1    male  40.520000  4308.4334
2       2  female  24.376552   793.1625
3       2    male  30.940678  1271.6332
4       3  female  23.073400   988.9293
5       3    male  24.525104  1714.8208

### Q_4: Create a pivot table showing the survival rate (mean of Survived) for each combination of Sex and Pclass.

In [42]:
pivot_table = df.pivot_table(
    values='Survived',
    index='Sex',
    columns='Pclass',
    aggfunc='mean'
)

print(pivot_table)

Pclass    1    2    3
Sex
female  1.0  1.0  1.0
male    0.0  0.0  0.0

#### Q_5: Add a synthetic Date column with dates starting from 1912-04-10 (one day per passenger). Convert it to datetime and compute the monthly survival count.

In [44]:
df['Date'] = pd.date_range(start='1912-04-10', periods=len(df), freq='D')
df['Date'] = pd.to_datetime(df['Date'])
df['Month'] = df['Date'].dt.to_period('M')
monthly_survival_count = df[df['Survived'] == 1].groupby('Month').size()

print(monthly_survival_count)

Month
1912-04     9
1912-05    11
1912-06    12
1912-07    11
1912-08    12
1912-09    10
1912-10    12
1912-11    12
1912-12    11
1913-01    10
1913-02     7
1913-03     9
1913-04    15
1913-05    11
Freq: M, dtype: int64

In [ ]:
|